[
	[
		{
			"speaker" : "Slug",
			"dialog" : "WOW, this shop is huge!",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Rick",
			"dialog" : "Don't get lost, you have four aisles to pick groceries from.",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Rick",
			"dialog" : "Let me explain the what is what first."

		},

		{
			"speaker" : "Rick",
			"dialog" : "The biggest play area on the left is the actual shop, "

		},

		{
			"speaker" : "Rick",
			"dialog" : "You can click the tabs on the top to go anywhere you want to in real game. "

		},

		{
			"speaker" : "Rick",
			"dialog" : "If you get lost, I will sell you out here, and you will become dinner on these people's dish"

		},

		{
			"speaker" : "Slug",
			"dialog" : "No Rick, you can't do this, I don't want to poison these people. ",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Slug",
			"dialog" : "What can I do with those potatoes?"
		},

		{
			"speaker" : "Rick",
			"dialog" : "Why you always ask these obvious questions, you need to check the quality and pick as you did everyday",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Rick",
			"dialog" : "Now listen to me. Try right-click to check each potato's quality"
		},

		{
			"speaker" : "Rick",
			"dialog" : "and then use left-click to buy"
		},

		{
			"speaker" : "Slug",
			"dialog" : "These potatoes look nice, I will buy all of them. ouch! why my camera is shaking",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "That means you don't have enough money you dumbass, bad quality and good quality have the same price",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Rick",
			"dialog" : "So be cautious when you choose your groceries"
		},

		{
			"speaker" : "Rick",
			"dialog" : "Once you pick them, they will be added to the basket, the bottom right area."
		},

		{
			"speaker" : "Slug",
			"dialog" : "But what does this big order thing does",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Rick",
			"dialog" : "It's order menu for those people who want higher points, I will explain it later",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Rick",
			"dialog" : "Also, you will get bonus points, if you spend almost all budget in shopping"
		},


		{
			"speaker" : "Rick",
			"dialog" : "Hurry up Slug, my stomach is growling let's head to another stage"
		},

		{
			"speaker" : "Slug",
			"dialog" : "Ok man, Let me move my mouse to the basket to check out",
			"newSpeaker" : "true"
		}

	]

]