[
	[
		{
			"speaker" : "Slug",
			"dialog" : "WOW, this shop is huge!",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Rick",
			"dialog" : "Don't get lost, you have four aisles to pick groceries from.",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "In the real game, click the tab on the top to switch the aisles, but for now, I am showing you my private aisle"

		},


		{
			"speaker" : "Slug",
			"dialog" : "That's cool Rick, What if I get lost. ",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "You can press [R] to return to the title at anytime from any where. However, you are stupid slug, I will leave you here! ",
			"newSpeaker" : "true"

		},

		{
			"speaker" : "Slug",
			"dialog" : "Please Rick, don't do that to me. Okay, Okay I am going to shop now, what should I do?",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "First, watch your budget, that's the money you have for all groceries, if your camera is shaking, that means you don't have enough money",
			"newSpeaker" : "true"

		},

		{
			"speaker" : "Slug",
			"dialog" : "ok, so the second step just to [left-click] to pick the potato I want to buy?",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "Yes, but NO. You always need to check the quality first. Now [right-click]",
			"newSpeaker" : "true"
		},

		{
			"speaker" : "Slug",
			"dialog" : "I get it. I get it Rick, so better quality means more points in cooking am I right. ",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "Finally, you know something. yes, that's correct, if you make dish with shXt, you got negative points as well",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Slug",
			"dialog" : "Jeez! I will be careful then",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "Hurry up, you idiot. The coveyor belt is moving, people will pick you and grab your wallet!!",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "So be cautious when you choose your groceries"
		},


		{
			"speaker" : "Slug",
			"dialog" : "Thanks man, that was close..... by the way, I got what the order is asking for",
			"newSpeaker" : "true"
		},



		{
			"speaker" : "Rick",
			"dialog" : "Good, but that's not enough, you can make whatever you want in cooking, so better spend all of your budget on groceries",
			"newSpeaker" : "true"
		},


		{
			"speaker" : "Rick",
			"dialog" : "You will get bonus point based on how much budget you left as well."
		},


		{
			"speaker" : "Rick",
			"dialog" : "but since we are slugs, we have bigger dream other than that, so for now, just [move your mouse to the basket] to [check out]"
		}
	]

]